load-test-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load-tests/credits-api-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 1m0s (gracefulStop: 30s)

time="2025-11-29T11:35:27+05:30" level=info msg="🚀 Starting load test..." source=console
time="2025-11-29T11:35:27+05:30" level=info msg="Target: http://localhost:3000" source=console
time="2025-11-29T11:35:27+05:30" level=info msg="Test: Credits API with caching" source=console

running (0m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m01.0s/1m0s

running (0m02.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m02.0s/1m0s

running (0m03.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m03.0s/1m0s

running (0m04.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m04.0s/1m0s

running (0m05.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m05.0s/1m0s

running (0m06.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m06.0s/1m0s

running (0m07.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m07.0s/1m0s

running (0m08.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m08.0s/1m0s

running (0m09.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m09.0s/1m0s

running (0m10.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m10.0s/1m0s

running (0m11.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m11.0s/1m0s

running (0m12.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m12.0s/1m0s

running (0m13.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m13.0s/1m0s

running (0m14.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  0m14.0s/1m0s

running (0m15.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  0m15.0s/1m0s

running (0m16.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m16.0s/1m0s

running (0m17.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  0m17.0s/1m0s

running (0m18.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m18.0s/1m0s

running (0m19.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m19.0s/1m0s

running (0m20.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  0m20.0s/1m0s

running (0m21.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  0m21.0s/1m0s

running (0m22.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m22.0s/1m0s

running (0m23.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  0m23.0s/1m0s

running (0m24.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  0m24.0s/1m0s

running (0m25.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m25.0s/1m0s

running (0m26.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  0m26.0s/1m0s

running (0m27.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  0m27.0s/1m0s

running (0m28.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m28.0s/1m0s

running (0m29.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  0m29.0s/1m0s

running (0m30.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  0m30.0s/1m0s

running (0m31.0s), 20/20 VUs, 300 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  0m31.0s/1m0s

running (0m32.0s), 20/20 VUs, 300 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  0m32.0s/1m0s

running (0m33.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  0m33.0s/1m0s

running (0m34.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  0m34.0s/1m0s

running (0m35.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  0m35.0s/1m0s

running (0m36.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  0m36.0s/1m0s

running (0m37.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  0m37.0s/1m0s

running (0m38.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  0m38.0s/1m0s

running (0m39.0s), 20/20 VUs, 380 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  0m39.0s/1m0s

running (0m40.0s), 20/20 VUs, 380 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  0m40.0s/1m0s

running (0m41.0s), 20/20 VUs, 400 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  0m41.0s/1m0s

running (0m42.0s), 20/20 VUs, 400 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  0m42.0s/1m0s

running (0m43.0s), 20/20 VUs, 420 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  0m43.0s/1m0s

running (0m44.0s), 20/20 VUs, 420 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  0m44.0s/1m0s

running (0m45.0s), 20/20 VUs, 440 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  0m45.0s/1m0s

running (0m46.0s), 20/20 VUs, 440 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  0m46.0s/1m0s

running (0m47.0s), 20/20 VUs, 460 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  0m47.0s/1m0s

running (0m48.0s), 20/20 VUs, 460 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  0m48.0s/1m0s

running (0m49.0s), 20/20 VUs, 480 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  0m49.0s/1m0s

running (0m50.0s), 20/20 VUs, 480 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  0m50.0s/1m0s

running (0m51.0s), 20/20 VUs, 500 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  0m51.0s/1m0s

running (0m52.0s), 20/20 VUs, 500 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  0m52.0s/1m0s

running (0m53.0s), 20/20 VUs, 520 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  0m53.0s/1m0s

running (0m54.0s), 20/20 VUs, 520 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  0m54.0s/1m0s

running (0m55.0s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  0m55.0s/1m0s

running (0m56.0s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  0m56.0s/1m0s

running (0m57.0s), 20/20 VUs, 560 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  0m57.0s/1m0s

running (0m58.0s), 20/20 VUs, 560 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  0m58.0s/1m0s

running (0m59.0s), 20/20 VUs, 580 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  0m59.0s/1m0s

running (1m00.0s), 20/20 VUs, 580 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  1m00.0s/1m0s
time="2025-11-29T11:36:28+05:30" level=info msg="✅ Load test complete!" source=console


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<200' p(95)=25.55ms

    http_req_failed
    ✗ 'rate<0.01' rate=91.66%


  █ TOTAL RESULTS 

    checks_total.......: 2400   39.607438/s
    checks_succeeded...: 54.16% 1300 out of 2400
    checks_failed......: 45.83% 1100 out of 2400

    ✗ balance status is 200
      ↳  0% — ✓ 0 / ✗ 600
    ✓ balance response time < 200ms
    ✗ pricing status is 200
      ↳  16% — ✓ 100 / ✗ 500
    ✓ pricing response time < 100ms

    HTTP
    http_req_duration..............: avg=9.22ms min=294µs  med=4.42ms max=186.3ms p(90)=11.01ms p(95)=25.55ms
      { expected_response:true }...: avg=7.75ms min=1.27ms med=3.84ms max=37.31ms p(90)=24.7ms  p(95)=32.18ms
    http_req_failed................: 91.66% 1100 out of 1200
    http_reqs......................: 1200   19.803719/s

    EXECUTION
    iteration_duration.............: avg=2.01s  min=2s     med=2.01s  max=2.2s    p(90)=2.02s   p(95)=2.05s  
    iterations.....................: 600    9.90186/s
    vus............................: 20     min=20           max=20
    vus_max........................: 20     min=20           max=20

    NETWORK
    data_received..................: 1.5 MB 26 kB/s
    data_sent......................: 127 kB 2.1 kB/s



running (1m00.6s), 00/20 VUs, 600 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  1m0s
time="2025-11-29T11:36:29+05:30" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"